<?php

/*********************************************************
 * имя класса: OwnBB_Debug
 * функция класса: получение отладочной информации
 ********************************************************/
 
class OwnBB_Debug {

	/*
	//////////////////////
	/////СВОЙСТВА/////////
	//////////////////////
	*/

	/**
	 * включена ли отладка
	 * (boolean)
	 */
	var $IsDebug;

	/**
	 * время старта скрипта
	 * (integer)
	 */
	var $StartMicrotime;

	/**
	 * время окончания скрипта
	 * (integer)
	 */
	var $EndMicrotime;

	/*
	//////////////////////
	/////МЕТОДЫ///////////
	//////////////////////
	*/

}

?>